README.org
* WTF?

Learning [[https://github.com/digego/extempore][Extempore]] while following [[https://www.lightnote.co/course/][LightNote]] music theory course.

* Setup

  To run examples you need Extempore's master branch HEAD compiled. Version 0.7
  doesn't fit, because Extempore API is undergoing substantial change. Some of
  code suppose knowledge obtained from [[http://digego.github.io/extempore/index.html][official documentation]], especially about
  setup and language basics.

  To follow the course you need access to [[https://app.lightnote.co/][app,]] could be purchased [[https://www.lightnote.co/course/?ref=sidebarpremium#buy][here.]] But
  following course is not required for reading this document, especially if you
  are already familiar with basic music theory and came here for Extempore
  examples.

  If you are proficient with org-mode, you already know how it would best for
  you to run examples. Otherwise you have two basic options:

  1. Copy and paste code to buffer/editor from which you know how to send it to
     Extempore compiler (see [[http://digego.github.io/extempore/index.html][documentation]]). Blocks are enclosed with xml-like
     comments to help you because GitHub org renderer doesn't do tangling. HTML
     exported version is included in repo (read it [[http://ul.mantike.pro/lightnote/][here]]) for easier following,
     but it's not guaranteed to be up-to-date.
  2. If you have Emacs installed then run =tangle.sh= to produce xtm files and
     run code from them. Xml-like comments with block names helps here with
     following too. Generated files are included in this repo either, but they
     are not guaranteed to be up-to-date.

* The Essential Guide to Music Theory

** Sound
*** [[https://app.lightnote.co/sound][Sound]]

    To produce sound in Extempore we need to setup xtlang callback:

#+NAME: set-dsp
#+BEGIN_SRC extempore
  ;; <set-dsp>
  (dsp:set! dsp)
  ;; </set-dsp>
#+END_SRC

#+NAME: xtm/00-sound-silence.xtm
#+BEGIN_SRC extempore :tangle xtm/00-sound-silence.xtm :noweb yes :mkdirp yes :padline no
  ;; <xtm/00-sound-silence.xtm>
  (bind-func dsp:DSP
    (lambda (in time chan dat)
      0.0))
  <<set-dsp>>
  ;; </xtm/00-sound-silence.xtm>
#+END_SRC

    Note callback signature:

    - in:SAMPLE :: sample from input device
    - time:i64 :: sample number
    - chan:i64 :: audio channel
    - dat:SAMPLE* :: user data
    - <return>:SAMPLE :: sample at given channel and time

    sample value varies from -1.0 to 1.0

    You can set dsp function once, but then redefine it as many times as your
    want. Our first attempt produces silence, let's make it more audible:

#+NAME: xtm/01-sound-sine.xtm
#+BEGIN_SRC extempore :tangle xtm/01-sound-sine.xtm :noweb yes :mkdirp yes :padline no
  ;; <xtm/01-sound-sine.xtm>
  (bind-func dsp:DSP
    (lambda (in time chan dat)
      (let ((amplitude 0.5)
            (frequency 440.0))
        (* amplitude
           (sin (* frequency
                   (/ STWOPI SRf)
                   (convert time)))))))
  <<set-dsp>>
  ;; </xtm/01-sound-sine.xtm>
#+END_SRC

    =STWOPI= is /2pi of type SAMPLE/ constant, and =convert= allows us to make a
    =SAMPLE= typed value from =time=. =SRf= refers to current sampling frequency.
    Extempore uses symbiosis of two different languages with similar, LISPy,
    syntax: Scheme and xtlang. Performance-sensitive parts (usually dsp) are
    implemented in xtlang, and other stuff (usually control) is done in Scheme.
    xtlang is very much like C but with LISP syntax and proper closures.

    So far so good, we've obtained a basic form of sound — a sine wave.
    Amplitude, or height of the wave (in case you are following graphics in
    course), in our example is half of maximum available. =sin= ranges from -1.0
    to 1.0 and we multiply it by 0.5. It affects sound loudness. Try to play with
    it.

    Frequency, or density of the wave, is perceived as a pitch. Play with it.

