README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-03-24 Fri 16:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rprakapchuk" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaee9182">1. WTF?</a></li>
<li><a href="#orgbbee8ff">2. Setup</a></li>
<li><a href="#org23e7041">3. The Essential Guide to Music Theory</a>
<ul>
<li><a href="#orgddaf4b1">3.1. Sound</a>
<ul>
<li><a href="#org1dcd19e">3.1.1. Sound</a></li>
<li><a href="#org78a92a4">3.1.2. Harmony</a></li>
<li><a href="#org30c2e2b">3.1.3. Intermezzo: <code>osc_c</code></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgaee9182" class="outline-2">
<h2 id="orgaee9182"><span class="section-number-2">1</span> WTF?</h2>
<div class="outline-text-2" id="text-1">
<p>
Learning <a href="https://github.com/digego/extempore">Extempore</a> while following <a href="https://www.lightnote.co/course/">LightNote</a> music theory course.
</p>
</div>
</div>

<div id="outline-container-orgbbee8ff" class="outline-2">
<h2 id="orgbbee8ff"><span class="section-number-2">2</span> Setup</h2>
<div class="outline-text-2" id="text-2">
<p>
To run examples you need Extempore's master branch HEAD compiled. Version 0.7
doesn't fit, because Extempore API is undergoing substantial change. Some of
code suppose knowledge obtained from <a href="http://digego.github.io/extempore/index.html">official documentation</a>, especially about
setup and language basics.
</p>

<p>
To follow the course you need access to <a href="https://app.lightnote.co/">app,</a> could be purchased <a href="https://www.lightnote.co/course/?ref=sidebarpremium#buy">here.</a> But
following course is not required for reading this document, especially if you
are already familiar with basic music theory and came here for Extempore
examples.
</p>

<p>
If you are proficient with org-mode, you already know how it would best for
you to run examples. Otherwise you have two basic options:
</p>

<ol class="org-ol">
<li>Copy and paste code to buffer/editor from which you know how to send it to
Extempore compiler (see <a href="http://digego.github.io/extempore/index.html">documentation</a>). Blocks are enclosed with xml-like
comments to help you because GitHub org renderer doesn't do tangling. HTML
exported version is included in repo (read it <a href="http://ul.mantike.pro/lightnote/">here</a>) for easier following,
but it's not guaranteed to be up-to-date.</li>
<li>If you have Emacs installed then run <code>tangle.sh</code> to produce xtm files and
run code from them. Xml-like comments with block names helps here with
following too. Generated files are included in this repo either, but they
are not guaranteed to be up-to-date.</li>
</ol>
</div>
</div>

<div id="outline-container-org23e7041" class="outline-2">
<h2 id="org23e7041"><span class="section-number-2">3</span> The Essential Guide to Music Theory</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgddaf4b1" class="outline-3">
<h3 id="orgddaf4b1"><span class="section-number-3">3.1</span> Sound</h3>
<div class="outline-text-3" id="text-3-1">
</div><div id="outline-container-org1dcd19e" class="outline-4">
<h4 id="org1dcd19e"><span class="section-number-4">3.1.1</span> <a href="https://app.lightnote.co/sound">Sound</a></h4>
<div class="outline-text-4" id="text-3-1-1">
<p>
To produce sound in Extempore we need to setup xtlang callback:
</p>

<div class="org-src-container">
<pre class="src src-extempore" id="orgfa5992f"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;set-dsp&gt;</span>
<span style="color: #707183;">(</span>dsp<span style="color: #6434A3;">:set!</span> dsp<span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/set-dsp&gt;</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-extempore" id="orgaf9e8b7"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;xtm/00-sound-silence.xtm&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">dsp</span><span style="color: #6434A3;">:DSP</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>in time chan dat<span style="color: #909183;">)</span>
    <span style="color: #D0372D;">0.0</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;set-dsp&gt;</span>
<span style="color: #707183;">(</span>dsp<span style="color: #6434A3;">:set!</span> dsp<span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/set-dsp&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/xtm/00-sound-silence.xtm&gt;</span>
</pre>
</div>

<p>
Note callback signature:
</p>

<dl class="org-dl">
<dt>in:SAMPLE</dt><dd>sample from input device</dd>
<dt>time:i64</dt><dd>sample number</dd>
<dt>chan:i64</dt><dd>audio channel</dd>
<dt>dat:SAMPLE*</dt><dd>user data</dd>
<dt>&lt;return&gt;:SAMPLE</dt><dd>sample at given channel and time</dd>
</dl>

<p>
sample value varies from -1.0 to 1.0
</p>

<p>
You can set dsp function once, but then redefine it as many times as your
want. Our first attempt produces silence, let's make it more audible:
</p>

<div class="org-src-container">
<pre class="src src-extempore" id="orgc4170f6"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;xtm/01-sound-sine.xtm&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">dsp</span><span style="color: #6434A3;">:DSP</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>in time chan dat<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>amplitude <span style="color: #D0372D;">0.5</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>frequency <span style="color: #D0372D;">440.0</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #006699;">*</span> amplitude
         <span style="color: #907373;">(</span><span style="color: #006699;">sin</span> <span style="color: #6276BA;">(</span><span style="color: #006699;">*</span> frequency
                 <span style="color: #858580;">(</span><span style="color: #006699;">/</span> STWOPI SRf<span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>convert time<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;set-dsp&gt;</span>
<span style="color: #707183;">(</span>dsp<span style="color: #6434A3;">:set!</span> dsp<span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/set-dsp&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/xtm/01-sound-sine.xtm&gt;</span>
</pre>
</div>

<p>
<code>STWOPI</code> is <i>2pi of type SAMPLE</i> constant, and <code>convert</code> allows us to make a
<code>SAMPLE</code> typed value from <code>time</code>. <code>SRf</code> refers to current sampling frequency.
Extempore uses symbiosis of two different languages with similar, LISPy,
syntax: Scheme and xtlang. Performance-sensitive parts (usually dsp) are
implemented in xtlang, and other stuff (usually control) is done in Scheme.
xtlang is very much like C but with LISP syntax and proper closures.
</p>

<p>
So far so good, we've obtained a basic form of sound — a sine wave.
Amplitude, or height of the wave (in case you are following graphics in
course), in our example is half of maximum available. <code>sin</code> ranges from -1.0
to 1.0 and we multiply it by 0.5. It affects sound loudness. Try to play with
it.
</p>

<p>
Frequency, or density of the wave, is perceived as a pitch. Play with it.
</p>
</div>

<ol class="org-ol"><li><a id="org48ee626"></a>MIDI controller<br /><div class="outline-text-5" id="text-3-1-1-1">
<p>
