README.org
**** MIDI controller

     While the essence of live coding is performance created with code,
     cyber-physical environment incorporates various media. Let's plug MIDI
     controller and play with amplitude and frequency using it. For that purpose
     we are going to load =midi_input= library:

#+NAME: load-midi-input
#+BEGIN_SRC extempore
  ;; <load-midi-input>
  (sys:load "libs/external/midi_input.xtm")
  ;; </load-midi-input>
#+END_SRC

     It load a =portmidi= wrapper and tries to connect to the first midi device.
     The latter fact is important because if you will try to connect to this
     device again by =(set_midi_in 0)= you will get unhelpful error message
     /Invalid device ID./

     Look into console where you are running Extempore. =midi_input= calls
     =(pm_print_devices)= on startup. If you MIDI controller is listed under the
     index 0 then nothing to do. Otherwise execute (replace *3* with required index):

#+NAME: set-midi-in
#+BEGIN_SRC extempore
  ;; <set-midi-in>
  (set_midi_in 3)
  ;; </set-midi-in>
#+END_SRC

     To make our =dsp= function controllable outside let's move =amplitude= and
     =controller= outside of lambda:

#+NAME: sine-closure-dsp
#+BEGIN_SRC extempore
  ;; <sine-closure-dsp>
  (bind-func dsp:DSP
    (let ((amplitude 0.5)
          (frequency 440.0))
      (lambda (in time chan dat)
          (* amplitude
             (sin (* frequency
                     (/ STWOPI SRf)
                     (convert time)))))))
  ;; </sine-closure-dsp>
#+END_SRC

     xtlang has a nice feature: closure environment is accessible outside using
     dot-syntax, =(closure.variable:type)= as getter and =(closure.variable:type
     value)= as setter. This feature is arguable from the point of view of
     functional style leaning towards purity and referential transparency, but I
     guess it provides good trade for performance.

     To read values from controller we would override =midi_cc= function callback
     provided by =midi_input= (replace *19* and *23* with your knobs CCs):

#+NAME: sine-midi-cc
#+BEGIN_SRC extempore
  ;; <sine-midi-cc>
  (bind-func midi_cc
    (lambda (timestamp:i32 controller:i32 value:i32 chan:i32)
      (println "MIDI CC" controller value)
      (cond ((= controller 19) (dsp.amplitude:SAMPLE (/ (convert value) 127.)))
            ((= controller 23) (dsp.frequency:SAMPLE (* (convert value) 10.)))
            (else 0.0:f))
      void))
  ;; </sine-midi-cc>
#+END_SRC

     If you execute snippets one-by-one then you should have response already.
     Otherwise here is entire file:

#+NAME: xtm/02-sound-sine-midi.xtm
#+BEGIN_SRC extempore :tangle xtm/02-sound-sine-midi.xtm :noweb yes :mkdirp yes :padline no
  ;; <xtm/02-sound-sine-midi.xtm>
  <<load-midi-input>>
  <<sine-closure-dsp>>
  <<set-dsp>>
  ;; <<set-midi-in>>
  <<sine-midi-cc>>
  ;; </xtm/02-sound-sine-midi.xtm>
#+END_SRC

