README.html
While the essence of live coding is performance created with code,
cyber-physical environment incorporates various media. Let's plug MIDI
controller and play with amplitude and frequency using it. For that purpose
we are going to load <code>midi_input</code> library:
</p>

<div class="org-src-container">
<pre class="src src-extempore" id="org24a236b"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;load-midi-input&gt;</span>
<span style="color: #707183;">(</span>sys<span style="color: #6434A3;">:load</span> <span style="color: #008000;">"libs/external/midi_input.xtm"</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/load-midi-input&gt;</span>
</pre>
</div>

<p>
It load a <code>portmidi</code> wrapper and tries to connect to the first midi device.
The latter fact is important because if you will try to connect to this
device again by <code>(set_midi_in 0)</code> you will get unhelpful error message
<i>Invalid device ID.</i>
</p>

<p>
Look into console where you are running Extempore. <code>midi_input</code> calls
<code>(pm_print_devices)</code> on startup. If you MIDI controller is listed under the
index 0 then nothing to do. Otherwise execute (replace <b>3</b> with required index):
</p>

<div class="org-src-container">
<pre class="src src-extempore" id="orga957d4e"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;set-midi-in&gt;</span>
<span style="color: #707183;">(</span>set_midi_in <span style="color: #D0372D;">3</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/set-midi-in&gt;</span>
</pre>
</div>

<p>
To make our <code>dsp</code> function controllable outside let's move <code>amplitude</code> and
<code>controller</code> outside of lambda:
</p>

<div class="org-src-container">
<pre class="src src-extempore" id="org5dbd4df"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;sine-closure-dsp&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">dsp</span><span style="color: #6434A3;">:DSP</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>amplitude <span style="color: #D0372D;">0.5</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>frequency <span style="color: #D0372D;">440.0</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>in time chan dat<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #006699;">*</span> amplitude
           <span style="color: #907373;">(</span><span style="color: #006699;">sin</span> <span style="color: #6276BA;">(</span><span style="color: #006699;">*</span> frequency
                   <span style="color: #858580;">(</span><span style="color: #006699;">/</span> STWOPI SRf<span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span>convert time<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/sine-closure-dsp&gt;</span>
</pre>
</div>

<p>
xtlang has a nice feature: closure environment is accessible outside using
dot-syntax, <code>(closure.variable:type)</code> as getter and <code>(closure.variable:type
     value)</code> as setter. This feature is arguable from the point of view of
functional style leaning towards purity and referential transparency, but I
guess it provides good trade for performance.
</p>

<p>
To read values from controller we would override <code>midi_cc</code> function callback
provided by <code>midi_input</code> (replace <b>19</b> and <b>23</b> with your knobs CCs):
</p>

<div class="org-src-container">
<pre class="src src-extempore" id="org4cd6897"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;sine-midi-cc&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">midi_cc</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>timestamp<span style="color: #6434A3;">:i32</span> controller<span style="color: #6434A3;">:i32</span> value<span style="color: #6434A3;">:i32</span> chan<span style="color: #6434A3;">:i32</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #006699;">println</span> <span style="color: #008000;">"MIDI CC"</span> controller value<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #006699;">=</span> controller <span style="color: #D0372D;">19</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>dsp.amplitude<span style="color: #6434A3;">:SAMPLE</span> <span style="color: #6276BA;">(</span><span style="color: #006699;">/</span> <span style="color: #858580;">(</span><span style="color: #0000FF;">convert</span> value<span style="color: #858580;">)</span> <span style="color: #D0372D;">127.</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #006699;">=</span> controller <span style="color: #D0372D;">23</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>dsp.frequency<span style="color: #6434A3;">:SAMPLE</span> <span style="color: #6276BA;">(</span><span style="color: #006699;">*</span> <span style="color: #858580;">(</span><span style="color: #0000FF;">convert</span> value<span style="color: #858580;">)</span> <span style="color: #D0372D;">10.</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #0000FF;">else</span> <span style="color: #D0372D;">0.0:f</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #006699;">void</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/sine-midi-cc&gt;</span>
</pre>
</div>

<p>
If you execute snippets one-by-one then you should have response already.
Otherwise here is entire file:
</p>

<div class="org-src-container">
<pre class="src src-extempore" id="org39c5913"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;xtm/02-sound-sine-midi.xtm&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;load-midi-input&gt;</span>
<span style="color: #707183;">(</span>sys<span style="color: #6434A3;">:load</span> <span style="color: #008000;">"libs/external/midi_input.xtm"</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/load-midi-input&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;sine-closure-dsp&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">dsp</span><span style="color: #6434A3;">:DSP</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>amplitude <span style="color: #D0372D;">0.5</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>frequency <span style="color: #D0372D;">440.0</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>in time chan dat<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #006699;">*</span> amplitude
           <span style="color: #907373;">(</span><span style="color: #006699;">sin</span> <span style="color: #6276BA;">(</span><span style="color: #006699;">*</span> frequency
                   <span style="color: #858580;">(</span><span style="color: #006699;">/</span> STWOPI SRf<span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span>convert time<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/sine-closure-dsp&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;set-dsp&gt;</span>
<span style="color: #707183;">(</span>dsp<span style="color: #6434A3;">:set!</span> dsp<span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/set-dsp&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">;; &lt;set-midi-in&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">(set_midi_in 3)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">;; &lt;/set-midi-in&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;sine-midi-cc&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">midi_cc</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>timestamp<span style="color: #6434A3;">:i32</span> controller<span style="color: #6434A3;">:i32</span> value<span style="color: #6434A3;">:i32</span> chan<span style="color: #6434A3;">:i32</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #006699;">println</span> <span style="color: #008000;">"MIDI CC"</span> controller value<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #006699;">=</span> controller <span style="color: #D0372D;">19</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>dsp.amplitude<span style="color: #6434A3;">:SAMPLE</span> <span style="color: #6276BA;">(</span><span style="color: #006699;">/</span> <span style="color: #858580;">(</span><span style="color: #0000FF;">convert</span> value<span style="color: #858580;">)</span> <span style="color: #D0372D;">127.</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span><span style="color: #006699;">=</span> controller <span style="color: #D0372D;">23</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>dsp.frequency<span style="color: #6434A3;">:SAMPLE</span> <span style="color: #6276BA;">(</span><span style="color: #006699;">*</span> <span style="color: #858580;">(</span><span style="color: #0000FF;">convert</span> value<span style="color: #858580;">)</span> <span style="color: #D0372D;">10.</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #0000FF;">else</span> <span style="color: #D0372D;">0.0:f</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #006699;">void</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/sine-midi-cc&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/xtm/02-sound-sine-midi.xtm&gt;</span>
</pre>
</div>
</div></li></ol>
</div>
