README.org
**** DONE MIDI controller
     CLOSED: [2017-03-07 Tue 14:32]

     Let's do the trick and play notes from MIDI controller. The latest
     =midi_input= supports defining MIDI callback in Scheme (not only xtlang),
     it will make stuff easier for us because of no need to switch language
     contexts. Replace *19* with your pitch slider CC.

#+NAME: midi-chords-pitch
#+BEGIN_SRC extempore
  ;; <midi-chords-pitch>
  (define *pitch* 60)
  (define midi-cc
    (lambda (timestamp controller value chan)
      (cond ((= controller 19) (set! *pitch* value))
            (else #f))))
  ;; </midi-chords-pitch>
#+END_SRC

     Now let's control note start and stop. Replace *1* with you button NT.

#+NAME: midi-chords-play-button
#+BEGIN_SRC extempore
  ;; <midi-chords-play-button>
  (define midi-note-on
    (lambda (timestamp pitch volume chan)
      (if (= pitch 1)
          (play-chord (now) tuner (pleasant-chord *pitch*) 22050))))
  ;; </midi-chords-play-button>
#+END_SRC

     As an alternative, if you have MIDI keyboard, you can take pitch directly
     from pressed key:

#+NAME: midi-chords-play-keyboard
#+BEGIN_SRC extempore
  ;; <midi-chords-play-keyboard>
  (define midi-note-on
    (lambda (timestamp pitch volume chan)
      (play-chord (now) tuner (pleasant-chord pitch) 22050)))
  ;; </midi-chords-play-keyboard>
#+END_SRC

     To make it work we need to start listener:

#+NAME: start-midi-listener
#+BEGIN_SRC extempore
  ;; <start-midi-listener>
  (scheme-midi-listener (*metro* 'get-beat 4) 1/24))
  ;; </start-midi-listener>
#+END_SRC

     And whole files for button and keyboard:

#+NAME: xtm/05-midi-chord-button.xtm
#+BEGIN_SRC extempore :tangle xtm/05-midi-chord-button.xtm :noweb yes :mkdirp yes :paddle no
  ;; <xtm/05-midi-chord-button.xtm>
  <<xtm/04-harmony-chord.xtm>>
  <<midi-chords-pitch>>
  <<midi-chords-play-button>>
  <<start-midi-listener>>
  ;; </xtm/05-midi-chord-button.xtm>
#+END_SRC

#+NAME: xtm/06-midi-chord-keyboard.xtm
#+BEGIN_SRC extempore :tangle xtm/06-midi-chord-keyboard.xtm :noweb yes :mkdirp yes :paddle no
  ;; <xtm/06-midi-chord-keyboard.xtm>
  <<xtm/04-harmony-chord.xtm>>
  <<midi-chords-play-keyboard>>
  <<start-midi-listener>>
  ;; </xtm/06-midi-chord-keyboard.xtm>
#+END_SRC

