README.html
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;midi-chords-play-keyboard&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">define</span> <span style="color: #006699;">midi-note-on</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>timestamp pitch volume chan<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>play-chord <span style="color: #709870;">(</span><span style="color: #006699;">now</span><span style="color: #709870;">)</span> tuner <span style="color: #709870;">(</span>pleasant-chord pitch<span style="color: #709870;">)</span> <span style="color: #D0372D;">22050</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/midi-chords-play-keyboard&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;start-midi-listener&gt;</span>
<span style="color: #707183;">(</span>scheme-midi-listener <span style="color: #7388D6;">(</span>*metro* 'get-beat <span style="color: #D0372D;">4</span><span style="color: #7388D6;">)</span> <span style="color: #D0372D;">1/24</span><span style="color: #707183;">)</span><span style="background-color: #FFDCDC; text-decoration: underline;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/start-midi-listener&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/xtm/06-midi-chord-keyboard.xtm&gt;</span>
</pre>
</div>
</div></li></ol>
</div>
