README.html

<div id="outline-container-org30c2e2b" class="outline-4">
<h4 id="org30c2e2b"><span class="section-number-4">3.1.3</span> Intermezzo: <code>osc_c</code></h4>
<div class="outline-text-4" id="text-3-1-3">
<p>
I mentioned Extempore's <code>osc_c</code> briefly as an alternative for hand-rolled
sine wave generator. Now it's time to write down (and hear!) difference
between the two. <code>osc_c</code> encloses phase, and our <code>sine</code> takes it implicitly
as a timestamp. But in this case it's not just a question of style (FP-ish
explicit argument passing vs OOP-y mixing state with code), but a subtle
difference in behavior. Waves produced by both oscillators are the same when
frequency stays constant. But <code>sine</code> goes glitchy when frequency changes,
that's why usually <code>osc_c</code> is the way to go (though sometimes you want to
produce glitches on purpose).
</p>

<p>
To hear the difference let's apply frequency modulation to our <code>tuner</code> and
make&#x2026; hmmm&#x2026; <code>fm_tuner</code> instrument ;-)
</p>

<div class="org-src-container">
<pre class="src src-extempore" id="org50abb7e"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;fm-tuner-note&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">fm_tuner_note</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">()</span>
    <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here you can put init of entire instrument</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>data<span style="color: #6434A3;">:NoteData*</span> nargs<span style="color: #6434A3;">:i64</span> dargs<span style="color: #6434A3;">:SAMPLE*</span><span style="color: #709870;">)</span>
      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here init of certain note</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">let</span> <span style="color: #907373;">(</span><span style="color: #6276BA;">(</span>frequency <span style="color: #858580;">(</span>note_frequency data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>amplitude <span style="color: #858580;">(</span>note_amplitude data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>starttime <span style="color: #858580;">(</span>note_starttime data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>duration <span style="color: #858580;">(</span>note_duration data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #6276BA;">(</span>time<span style="color: #6434A3;">:i64</span> chan<span style="color: #6434A3;">:i64</span><span style="color: #6276BA;">)</span>
          <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here we produce samples for this note</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> <span style="color: #858580;">(</span><span style="color: #006699;">&lt;</span> <span style="color: #80A880;">(</span><span style="color: #006699;">-</span> time starttime<span style="color: #80A880;">)</span> duration<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span><span style="color: #006699;">*</span> amplitude
                 <span style="color: #80A880;">(</span>sine time <span style="color: #887070;">(</span><span style="color: #006699;">+</span> frequency
                               <span style="color: #707183;">(</span><span style="color: #006699;">*</span> <span style="color: #D0372D;">50.0</span>
                                  <span style="color: #7388D6;">(</span>sine time <span style="color: #909183;">(</span><span style="color: #006699;">*</span> <span style="color: #D0372D;">0.1</span> frequency<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
              <span style="color: #D0372D;">0.0</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/fm-tuner-note&gt;</span>
</pre>
</div>

<p>
And <code>fm_tuner_fx</code> will still do nothing (but don't hesitate to edit it by
your taste!)
</p>

<div class="org-src-container">
<pre class="src src-extempore" id="orgb6d4b4d"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;fm-tuner-fx&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">fm_tuner_fx</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">()</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>in<span style="color: #6434A3;">:SAMPLE</span> time<span style="color: #6434A3;">:i64</span> chan<span style="color: #6434A3;">:i64</span> dat<span style="color: #6434A3;">:SAMPLE*</span><span style="color: #709870;">)</span>
      in<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/fm-tuner-fx&gt;</span>
</pre>
</div>

<p>
The moment of truth, our poor-man FM-synth sound:
</p>

<div class="org-src-container">
<pre class="src src-extempore" id="org6c3cc5f"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;xtm/07-fm-tuner-sine.xtm&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;load-instruments&gt;</span>
<span style="color: #707183;">(</span>sys<span style="color: #6434A3;">:load</span> <span style="color: #008000;">"libs/core/instruments.xtm"</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/load-instruments&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;define-sine&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-val</span> <span style="color: #006699;">omega</span> <span style="color: #6434A3;">SAMPLE</span> <span style="color: #7388D6;">(</span><span style="color: #006699;">/</span> STWOPI SRf<span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">sine</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>time<span style="color: #6434A3;">:i64</span> freq<span style="color: #6434A3;">:SAMPLE</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #006699;">sin</span> <span style="color: #709870;">(</span><span style="color: #006699;">*</span> omega freq <span style="color: #907373;">(</span>convert time<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/define-sine&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;fm-tuner-note&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">fm_tuner_note</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">()</span>
    <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here you can put init of entire instrument</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>data<span style="color: #6434A3;">:NoteData*</span> nargs<span style="color: #6434A3;">:i64</span> dargs<span style="color: #6434A3;">:SAMPLE*</span><span style="color: #709870;">)</span>
      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here init of certain note</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">let</span> <span style="color: #907373;">(</span><span style="color: #6276BA;">(</span>frequency <span style="color: #858580;">(</span>note_frequency data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>amplitude <span style="color: #858580;">(</span>note_amplitude data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>starttime <span style="color: #858580;">(</span>note_starttime data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>duration <span style="color: #858580;">(</span>note_duration data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #6276BA;">(</span>time<span style="color: #6434A3;">:i64</span> chan<span style="color: #6434A3;">:i64</span><span style="color: #6276BA;">)</span>
          <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here we produce samples for this note</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> <span style="color: #858580;">(</span><span style="color: #006699;">&lt;</span> <span style="color: #80A880;">(</span><span style="color: #006699;">-</span> time starttime<span style="color: #80A880;">)</span> duration<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span><span style="color: #006699;">*</span> amplitude
                 <span style="color: #80A880;">(</span>sine time <span style="color: #887070;">(</span><span style="color: #006699;">+</span> frequency
                               <span style="color: #707183;">(</span><span style="color: #006699;">*</span> <span style="color: #D0372D;">50.0</span>
                                  <span style="color: #7388D6;">(</span>sine time <span style="color: #909183;">(</span><span style="color: #006699;">*</span> <span style="color: #D0372D;">0.1</span> frequency<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
              <span style="color: #D0372D;">0.0</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/fm-tuner-note&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;fm-tuner-fx&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">fm_tuner_fx</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">()</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>in<span style="color: #6434A3;">:SAMPLE</span> time<span style="color: #6434A3;">:i64</span> chan<span style="color: #6434A3;">:i64</span> dat<span style="color: #6434A3;">:SAMPLE*</span><span style="color: #709870;">)</span>
      in<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/fm-tuner-fx&gt;</span>

<span style="color: #707183;">(</span>make-instrument fm_tuner fm_tuner<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">dsp</span><span style="color: #6434A3;">:DSP</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>in time chan dat<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>fm_tuner in time chan dat<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;set-dsp&gt;</span>
<span style="color: #707183;">(</span>dsp<span style="color: #6434A3;">:set!</span> dsp<span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/set-dsp&gt;</span>

<span style="color: #707183;">(</span>play-note <span style="color: #7388D6;">(</span><span style="color: #006699;">now</span><span style="color: #7388D6;">)</span> fm_tuner <span style="color: #D0372D;">60</span> <span style="color: #D0372D;">90</span> <span style="color: #D0372D;">44100</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/xtm/07-fm-tuner-sine.xtm&gt;</span>
</pre>
</div>

<p>
Do you hear? It's not even glitchy, it's just a noise. Let's do the same
synth using <code>osc_c</code>:
</p>

<div class="org-src-container">
<pre class="src src-extempore" id="orgc3e2d90"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;fm-tuner-note-osc&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">fm_tuner_note</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">()</span>
    <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here you can put init of entire instrument</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>data<span style="color: #6434A3;">:NoteData*</span> nargs<span style="color: #6434A3;">:i64</span> dargs<span style="color: #6434A3;">:SAMPLE*</span><span style="color: #709870;">)</span>
      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here init of certain note</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">let</span> <span style="color: #907373;">(</span><span style="color: #6276BA;">(</span>frequency <span style="color: #858580;">(</span>note_frequency data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>amplitude <span style="color: #858580;">(</span>note_amplitude data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>starttime <span style="color: #858580;">(</span>note_starttime data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>duration <span style="color: #858580;">(</span>note_duration data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>carrier <span style="color: #858580;">(</span>osc_c <span style="color: #D0372D;">0.0</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>modulator <span style="color: #858580;">(</span>osc_c <span style="color: #D0372D;">0.0</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #6276BA;">(</span>time<span style="color: #6434A3;">:i64</span> chan<span style="color: #6434A3;">:i64</span><span style="color: #6276BA;">)</span>
          <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here we produce samples for this note</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> <span style="color: #858580;">(</span><span style="color: #006699;">&lt;</span> <span style="color: #80A880;">(</span><span style="color: #006699;">-</span> time starttime<span style="color: #80A880;">)</span> duration<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>carrier amplitude
                       <span style="color: #80A880;">(</span><span style="color: #006699;">+</span> frequency
                          <span style="color: #887070;">(</span>modulator <span style="color: #D0372D;">50.0</span> <span style="color: #707183;">(</span><span style="color: #006699;">*</span> <span style="color: #D0372D;">0.1</span> frequency<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
              <span style="color: #D0372D;">0.0</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/fm-tuner-note-osc&gt;</span>
</pre>
</div>

<p>
And the file:
</p>

<div class="org-src-container">
<pre class="src src-extempore" id="orgc41c83d"><span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;xtm/08-fm-tuner-osc.xtm&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;load-instruments&gt;</span>
<span style="color: #707183;">(</span>sys<span style="color: #6434A3;">:load</span> <span style="color: #008000;">"libs/core/instruments.xtm"</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/load-instruments&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;fm-tuner-note-osc&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">fm_tuner_note</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">()</span>
    <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here you can put init of entire instrument</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>data<span style="color: #6434A3;">:NoteData*</span> nargs<span style="color: #6434A3;">:i64</span> dargs<span style="color: #6434A3;">:SAMPLE*</span><span style="color: #709870;">)</span>
      <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here init of certain note</span>
      <span style="color: #709870;">(</span><span style="color: #0000FF;">let</span> <span style="color: #907373;">(</span><span style="color: #6276BA;">(</span>frequency <span style="color: #858580;">(</span>note_frequency data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>amplitude <span style="color: #858580;">(</span>note_amplitude data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>starttime <span style="color: #858580;">(</span>note_starttime data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>duration <span style="color: #858580;">(</span>note_duration data<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>carrier <span style="color: #858580;">(</span>osc_c <span style="color: #D0372D;">0.0</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
            <span style="color: #6276BA;">(</span>modulator <span style="color: #858580;">(</span>osc_c <span style="color: #D0372D;">0.0</span><span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #6276BA;">(</span>time<span style="color: #6434A3;">:i64</span> chan<span style="color: #6434A3;">:i64</span><span style="color: #6276BA;">)</span>
          <span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">here we produce samples for this note</span>
          <span style="color: #6276BA;">(</span><span style="color: #0000FF;">if</span> <span style="color: #858580;">(</span><span style="color: #006699;">&lt;</span> <span style="color: #80A880;">(</span><span style="color: #006699;">-</span> time starttime<span style="color: #80A880;">)</span> duration<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>carrier amplitude
                       <span style="color: #80A880;">(</span><span style="color: #006699;">+</span> frequency
                          <span style="color: #887070;">(</span>modulator <span style="color: #D0372D;">50.0</span> <span style="color: #707183;">(</span><span style="color: #006699;">*</span> <span style="color: #D0372D;">0.1</span> frequency<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80A880;">)</span><span style="color: #858580;">)</span>
              <span style="color: #D0372D;">0.0</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/fm-tuner-note-osc&gt;</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;fm-tuner-fx&gt;</span>
<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">fm_tuner_fx</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">()</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #709870;">(</span>in<span style="color: #6434A3;">:SAMPLE</span> time<span style="color: #6434A3;">:i64</span> chan<span style="color: #6434A3;">:i64</span> dat<span style="color: #6434A3;">:SAMPLE*</span><span style="color: #709870;">)</span>
      in<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/fm-tuner-fx&gt;</span>

<span style="color: #707183;">(</span>make-instrument fm_tuner fm_tuner<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #0000FF;">bind-func</span> <span style="color: #006699;">dsp</span><span style="color: #6434A3;">:DSP</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">lambda</span> <span style="color: #909183;">(</span>in time chan dat<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>fm_tuner in time chan dat<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>

<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;set-dsp&gt;</span>
<span style="color: #707183;">(</span>dsp<span style="color: #6434A3;">:set!</span> dsp<span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/set-dsp&gt;</span>

<span style="color: #707183;">(</span>play-note <span style="color: #7388D6;">(</span><span style="color: #006699;">now</span><span style="color: #7388D6;">)</span> fm_tuner <span style="color: #D0372D;">60</span> <span style="color: #D0372D;">90</span> <span style="color: #D0372D;">44100</span><span style="color: #707183;">)</span>
<span style="color: #8D8D84;">;; </span><span style="color: #8D8D84; font-style: italic;">&lt;/xtm/08-fm-tuner-osc.xtm&gt;</span>
</pre>
</div>

<p>
This one is so nice, isn't it? Viva la <code>osc_c</code> ;-)
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: rprakapchuk</p>
<p class="date">Created: 2017-03-24 Fri 16:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
